# ArrowType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ArrowType Property
ParameterTypeId Class See Also
---
"Arrow Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ArrowType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArrowType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ArrowType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace